Repository: DiegoViqueira/MockHat
Catalog: Services/app/i18n/locales/*/LC_MESSAGES/messages.po
Languages: es

source: Incorrect email or password
es: Correo electrónico o contraseña incorrectos

source: User not found
es: Usuario no encontrado

source: User already exists
es: Usuario ya existe

source: Account not found
es: Cuenta no encontrada

source: Internal server error
es: Error del servidor interno

source: Invalid token type
es: Tipo de token inválido

source: Token validation failed
es: Error al validar el token

source: Authorization header missing
es: Falta el encabezado de autorización

source: Not authenticated
es: No autenticado

source: Class ID is required
es: ID de clase requerido

source: Assessment not found
es: Evaluación no encontrada

source: You are not allowed to create a writing for this assessment
es: No tienes permiso para crear una escritura para esta evaluación

source: Assessment is not in the pending state
es: La evaluación no está en estado pendiente

source: Student not found in class
es: Estudiante no encontrado en la clase

source: Teacher not found in class
es: Profesor no encontrado en la clase

source: User not verified
es: Usuario no verificado

source: Email already exists
es: Correo electrónico ya existe

source: Invalid user
es: Usuario inválido

source: You are not allowed to create a class
es: No tienes permiso para crear una clase

source: Error creating class
es: Error al crear la clase

source: Class not found
es: Clase no encontrada

source: Error getting class
es: Error al obtener la clase

source: Class already exists
es: Clase ya existe

source: Error listing classes
es: Error al listar las clases

source: Error you are not allowed to create a student
es: No tienes permiso para crear un estudiante

source: Error listing students
es: Error al listar los estudiantes

source: Error creating student
es: Error al crear el estudiante

source: Error updating student
es: Error al actualizar el estudiante

source: Student already exists
es: Estudiante ya existe

source: User does not exist
es: El usuario no existe

source: User is not an admin
es: El usuario no es administrador

source: Only Business accounts can have multiple users
es: Solo las cuentas de negocio pueden tener múltiples usuarios

source: Account has no users
es: La cuenta no tiene usuarios

source: Error removing user from account
es: Error al eliminar el usuario de la cuenta

source: Role not authorized
es: El rol no está autorizado

source: Role not found
es: El rol no encontrado

source: Could not validate credentials
es: No se pudieron validar las credenciales

source: Error creating user
es: Error al crear el usuario

source: Error updating user
es: Error al actualizar el usuario

source: Invalid image
es: Imagen Invalida

source: Assessment already exists
es: Evaluación ya existe

source: Error creating assessment
es: Error al crear la evaluación

source: Error transcribing assessment
es: Error al transcribir la evaluación

source: Error sending email
es: Error al enviar el correo electrónico

source: Error sending forgot password email
es: Error al enviar el correo electrónico de restablecimiento de contraseña

source: Error sending verification email
es: Error al enviar el correo electrónico de verificación

source: Error creating user
es: Error al crear el usuario

source: Error deleting user
es: Error al eliminar el usuario

source: Error listing users
es: Error al listar los usuarios

source: Error creating account
es: Error al crear la cuenta

source: Error getting account
es: Error al obtener la cuenta

source: Error updating account
es: Error al actualizar la cuenta

source: Error adding user to account
es: Error al agregar el usuario a la cuenta

source: Error transcribing answer
es: Error al transcribir la respuesta

source: Error changing password
es: Error al cambiar la contraseña

source: Error getting users by account
es: Error al obtener los usuarios por cuenta

source: Error creating user and account
es: Error al crear el usuario y la cuenta

source: Subscription not found
es: Suscripcion no encontrada

source: Error generating image URL
es: Error generando url de la imagen

source: Error uploading file
es: Error subiendo archivo

source: Error sending message to queue
es: Error enviando mensaje a la cola
